cats_app/app/controllers/cats_controller.rb

    def index
        # @cats = Cat.all.includes(:name, :birth_date, :color, :sex, :description)
        @cats = Cat.all
---
SELECT  "cats".* FROM "cats" ORDER BY "cats"."id" ASC LIMIT $1  [["LIMIT", 1]]